# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной 
# и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть
# count_coins = int(input("Введите количество монет "))
# import random
# n  = int(input("Количство монеток "))
# coins = [random.randint(0,1) for _ in range(n)]
# print(coins)
# x = 0
# y = 0
# for coin in coins:
#     if coin ==1:
#         x +=1
#     elif coin == 0:
#        y+=1
5# print(min(x, y))



# Петя задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.4 4 -> 2 2   5 6 -> 2 3
# s = int(input("сумма чисел "))
# p = int(input("произведение чисел "))
# for x in range (1, 1001):
#     for y in range (1, 1001):
#         if x + y == s and x * y == p:
#            print(x, ' ', y)


# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
# n = int(input(" число "))
# p = 1
# while p <= n:
#     print(p,end=' ')
#     p=p*2









